# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Zmy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [4]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Zmy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [4]:
df.groupby(df['Company']).mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

You can save this object as a new variable:

In [6]:
by_comp = df.groupby("Company")
by_comp

And then call aggregate methods off the object:

In [7]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [0]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [0]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [8]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Zmy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [9]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT     Vanessa    124

In [10]:
df[by_comp.min()>120]

TypeError: '>' not supported between instances of 'str' and 'int'

In [0]:
by_comp.max()

        Person  Sales
Company
FB       Sarah    350
GOOG       Sam    200
MSFT       Zmy    340

In [0]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [7]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [ ]:
# 269.75 is the value where if i

In [8]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [0]:
by_comp.describe().['GOOG']

SyntaxError: invalid syntax (<ipython-input-18-70c9b4bd4168>, line 1)

# END

In [9]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Zmy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Rev':[1000,2000,1500,3000,2000,2300]}

In [12]:
newdf=pd.DataFrame(data) 
newdf

  Company   Person  Sales   Rev
0    GOOG      Sam    200  1000
1    GOOG  Charlie    120  2000
2    MSFT      Zmy    340  1500
3    MSFT  Vanessa    124  3000
4      FB     Carl    243  2000
5      FB    Sarah    350  2300

In [13]:
objdf= newdf.groupby("Company")

In [24]:
a= pd.DataFrame(objdf.sum())
a["Sales"]

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64